uhnp/src/Enums/ВариантыОтраженияВУчетеВнеоборотныхАктивов/ВариантыОтраженияВУчетеВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияВУчетеВнеоборотныхАктивов</name>
  <enumValues>
    <name>УправленческомИРегламентированномУчетах</name>
  </enumValues>
  <enumValues>
    <name>УправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>РегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскомУчете</name>
  </enumValues>
  <enumValues>
    <name>НалоговомУчете</name>
  </enumValues>
  <enumValues>
    <name>УправленческомИБухгалтерскомУчете</name>
  </enumValues>
  <enumValues>
    <name>УправленческомИНалоговомУчете</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыОтраженияВУчетеВнеоборотныхАктивов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СписокВыбораУказан") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.УправленческомИРегламентированномУчетах);
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.УправленческомУчете);
		ДанныеВыбора.Добавить(Перечисления.ВариантыОтраженияВУчетеВнеоборотныхАктивов.РегламентированномУчете);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
